
import Foundation


extension String {
    
   static let infoText = "\nКак наработать полезную привычку ?\n\nИногда каждому из нас требуется выработать какую-то полезную привычку. Например, перейти на правильное питание, вставать пораньше, ходить на утренние пробежки или «подтянуть» разговорный английский. Но не всегда этот процесс проходит легко. Мы можем откладывать нужное действие до следующего понедельника, забывать о нем или быстро терять мотивацию. Далее ты узнаешь, как выработать полезную привычку за 21 день и бороться с возможными срывами.\n\n1. Принятие решения. Этот этап называют отправной точкой в процессе выработки полезного навыка. Здесь тебе стоит задать себе несколько важных вопросов: \n\nК чему я стремлюсь? \n\nКак я могу это получить? \n\nКакая привычка может помочь мне с этим? \n\nОтветив на них, можно начинать вырабатывать привычку. При этом настройся серьезно, чтобы не тратить время зря. 1. Принятие решения. Этот этап называют отправной точкой в процессе выработки полезного навыка. \n\n2. Сделай первый шаг. После принятия решения нужно первое действие: выйди на пробежку, приготовь полезный завтрак или заведи будильник пораньше. При этом не стоит откладывать, именно первый шаг может ускорить достижение желаемой цели. \n\n3. Повторяй нужное действие 2–3 дня подряд. На этом этапе происходит переход от единичного случая к привычному поведению. От тебя потребуется немного усилий и силы воли. \n\n4. Повторяй действие на протяжении недели. Этот этап немного сложнее: для настоящей привычки не существует выходных, дождливой погоды, плохого настроения или отпуска. Чтобы закрепить необходимое действие, повторяй его ежедневно в течение 7 дней. \n\n5. Следующая цель для формирования привычки — 21 день. Этот промежуток времени называют минимальным для закрепления новой модели поведения. Если ты сможешь повторять что-либо 3 недели подряд без пропусков, оно может стать неотъемлемой частью твоей жизни и превратиться в привычку. \n\n 6. Повторяй нужное действие 40 дней. Психологи утверждают, что за 40 дней привычка сможет полностью закрепиться, а в будущем человеку потребуется меньше усилий для поддержания нового режима. \n\n Приложение разработал: Микейлов Александр"
    
    static let infoHabits = "1) Введите название вашей привычки. \n\n\n2) Выберите цвет, который ассоциируется с вашей привычкой.\n\n\n3) Поставьте время выполнения привычки."
    
}










    


